currency_dict = {
    'рубль': ['руб', 'ру', 'рубл', 'рублей', 'рубли'],
    'доллар': ['дол', 'долл', 'доллар', '$', 'долларов'],
    'евро': ['евр', 'евро'],
    'лари': ['лар', 'лари', 'ларри'],
    'лиры': ['лир', 'лиры', 'лирры', 'т.лиры', 'тлиры','тлир']

    # Добавьте сюда другие валюты и их альтернативные названия
}

category_list = [
    'Квартплата', 'Коммуналка', 'Дом', 'Связь', 'Общественный',
    'Аптека', 'Продукты', 'Подписки',
    'Такси', 'Спорт', 'Подарки', 'Благотворительность', 'Одежда',
    'Ресторан', 'Фастфуд', 'Развлечения', 'Салон', 'Путешествия',
    'Личное', 'Здоровье', 'Прочее'
]